# MEPAnalyticalSegment Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSegment Class
Members See Also
---
Represents an analytical segment of the MEP analytical model.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class MEPAnalyticalSegment : IDisposable
```

Visual Basic
---
```text
Public Class MEPAnalyticalSegment _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MEPAnalyticalSegment : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..MEPAnalyticalSegment
# See Also
MEPAnalyticalSegment Members
Autodesk.Revit.DB.Analysis Namespace